{"/about/":{"data":{"":"Hugo is a static site generator developed based on the Go programming language, featuring blazingly fast building speed, simplicity of use, and high customizability. Without the need for database support, it can quickly convert content in markup languages (such as Markdown) into static HTML pages. Widely used in various website building scenarios such as personal blogs, project documents, and portfolios, Hugo is highly favored by developers and content creators.\nAs a concise and modern theme compatible with the Hugo framework, Hugo Narrow perfectly aligns with Hugo’s efficiency and flexibility, making it suitable for various types of website building needs. The theme offers rich support for content hosting, enabling easy creation of diverse content forms such as personal project displays, technical article publications, and photo galleries. Meanwhile, it comes with a complete set of practical features, including automatically generated table of contents, global content search, and LaTeX mathematical formula rendering. These features not only ensure the clear and orderly presentation of content but also greatly enhance the user’s browsing and usage experience, providing an efficient and aesthetically pleasing solution for Hugo site construction.","acknowledgments#Acknowledgments":"Hugo - Static site generation Tailwind CSS - CSS framework KaTeX - Math equation rendering Mermaid - Chart library gumshoe - Scroll spying Daisyui - Color Scheme reference Tweakcn - Color Scheme reference Hexo theme icarus - Search functionality reference Hugo Theme Stack - Bilibili and Tencent Video shortcodes Vercel - Demo Site Hextra - Documatation iconify - Icon library Glightbox - Lightbox library. flickr-justified-gallery - Justified image gallery. Macy.js - Masonry layout library. Augment Code - Code assistant"},"title":"About Hugo Narrow"},"/changelog/v1.0.0/":{"data":{"":"This release introduces the gallery; additionally, booth maps are automatically generated for posts cover, and SEO metadata is rendered via Hugo’s native templates.","improvements#Improvements":"Removed redundant metadata fields Fixed article navigation descriptions in post pages","new-features#New Features":"Integrated Hugo’s built-in SEO templates Implemented gallery and justified gallery support Added customizable placeholder images for article covers"},"title":"Narrow v1.0.0"},"/changelog/v1.1.0/":{"data":{"":"This release refactor the configuration of gallery, add a shortcode of masonry gallery.","breaking-changes#Breaking Changes":"Gallery configuration structure has been updated. Please update your Hugo configuration.\nparams: # GLightbox Configuration lightbox: enabled: false loop: true width: 80vw height: 80vh touchNavigation: true draggable: true zoomable: true preload: true descPosition: bottom # Justified Gallery Configuration justified_gallery: enabled: false rowHeight: 300 gutter: 30 lastRow: center transitionDuration: 0.3s resizeDebounce: 100 rowHeightTolerance: 0.25 maxRowsCount: 999999 calculateItemsHeight: false Visit Release Notes .","bug-fixes#Bug Fixes":"Fixed i18n translation issues in post-meta component Resolved analytics template inclusion problem","improvements#Improvements":"New Lightbox System: Migrated from lightGallery to GLightbox for improved performance and modern user experience Enhanced Justified Layout: Replaced jQuery-based justified gallery with flickr-justified-gallery for better native JavaScript support Removed jQuery Dependency: Complete elimination of jQuery from the gallery system, resulting in faster loading times and reduced bundle size","new-features#New Features":"Masonry Gallery Shortcode: Added support for masonry/waterfall layout with the new {\\{\u003c masonry \u003e}} shortcode {\\{\u003c masonry columns=4 gutter=15 \u003e}\\} ![Image 1](image1.jpg) ![Image 2](image2.jpg) {\\{\u003c /masonry \u003e}\\}"},"title":"Narrow v1.1.0"},"/changelog/v1.1.1/":{"data":{"":"This release fix the issues of gallery configuration.","bug-fixes#Bug Fixes":"Fixed masonry shortcode style failure caused by duplicate IDs Fixed glightbox and Justified parameter settings not taking effect","style-improvements#Style Improvements":"Optimized link and footnote styles Added scrollbar styling More color schemes from tweakcn"},"title":"Narrow v1.1.1"},"/changelog/v1.1.2/":{"data":{"":"This release optimize the parameters of posts license.","breaking-changes#Breaking Changes":"license params add author and show params delete showLicense params params: post: - showLicense: true license: + show: true + author: \"Hugo Narrow\" name: \"CC BY-NC-SA 4.0\" description: \"This work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License. Please attribute the source, use non-commercially, and maintain the same license.\" url: \"https://creativecommons.org/licenses/by-nc-sa/4.0/\" displayName: \"CC BY-NC-SA 4.0\"","bug-fixes#Bug Fixes":"Fixed frontmatter license params is not taking effect.","style#Style":"Image display center."},"title":"Narrow v1.1.2"},"/changelog/v1.1.3/":{"data":{"":"This release optimize some style and improve the experience of toc, add a template and a shortcode.","bug-fixes#Bug Fixes":"Post cover placeholder not effect. regular page comments doesn’t display. License url too long to page overflow.","feature#Feature":"New About partials. New link shortcode. Improve search and TOC user experience.","refactor#Refactor":"Refactor CSS framework, delete @tailwindcss/typography dependency.","style#Style":"Codeblock plaintext style. Github Alert style. Post card style. Order list number color. Related post style minilize. Post navigation height."},"title":"Narrow v1.1.3"},"/changelog/v1.1.4/":{"data":{"":"This release add language switch mode parameters.","bug-fixes#Bug Fixes":"fix post card summary index order. fix reading progress and codeblock configuration.","new-features#New Features":"add language switch mode, new params params: languageSwitchMode, support dropdown and cycle options.","style#Style":"add license information at footer."},"title":"Narrow v1.1.4"},"/changelog/v1.1.5/":{"data":{"":"This release add dock display mode parameter.","new-features#New Features":"Open external links in new tabs. Support for custom JavaScript files. Add a 404 template. Add dock display mode parameters. params + dock: float # Options: \"scroll\" (show on scroll up), \"always\" (always visible), \"float\" (floating)","style#Style":"Modify the color of superscripts and subscripts Adjust the bottom padding of alert blockquotes"},"title":"Narrow v1.1.5"},"/changelog/v1.1.6/":{"data":{"":"This release add custom content at homepage.","bug-fixes#Bug Fixes":"Fixed incorrect parameter name for clarity in the site configuration file","new-features#New Features":"Homepage author information now supports i18n translation\nAdded custom content template between homepage author information and recent posts\n+ params: + home_custom: + enabled: true + files: + - custom_1.html + - custom_2.html"},"title":"Narrow v1.1.6"},"/changelog/v1.2.0/":{"data":{"":"This release includes extensive optimizations. it’s recommend reviewing and validating your Hugo configuration post-update.","breaking-changes#Breaking Changes":"Some parameter levels have been adjusted and the TOC parameter has been added. The specific parameter changes are as follows:\n- params: - logo: - image: \"\" - link: \"\" - stickyHeader: true - showThemeSwitch: true - showDarkModeSwitch: true - showLanguageSwitch: true - languageSwitchMode: \"dropdown\" + params: + header: + sticky: true + logo: + image: \"\" + link: \"\" + showThemeSwitch: true + showDarkMode: true + showLanguageSwitch: true + languageSwitchMode: \"dropdown\" + toc: + position: left # left | right | card + maxWidth: \"280px\" + maxHeight: \"80vh\"","bug-fixes#Bug Fixes":"Icon templates now support solid icons without affecting references in the configuration file Adjust some style class names","new-features#New Features":"Supports sidebar table of contents (TOC). Initialize go.mod to support importing the theme via Hugo mod Support custom order for homepage sections","refactors#Refactors":"Split the example site configuration Adjust the parameter hierarchy of the header"},"title":"Narrow v1.2.0"},"/changelog/v1.2.1/":{"data":{"":"This release add a new content type for projects and two shortcodes button, icon.","bug-fixes#Bug Fixes":"Remove redundant style files Adjust link class to fix unwanted element underlines","button-shortcodes#Button Shortcodes":"{\\{\u003c button text=\"Learn More\" url=\"/about\" \u003e}\\} {\\{\u003c button text=\"GitHub\" url=\"https://github.com\" icon=\"github\" target=\"_self\" \u003e}\\} {\\{\u003c button text=\"Download\" url=\"/download\" variant=\"outline\" size=\"lg\" \u003e}\\} Parameters:\ntext: Button text (required, or use inner content) url: Link address (required) variant: primary, secondary, outline (default: primary) size: sm, md, lg (default: md) icon: Theme icon name target: _blank, _self (default: _blank) rel: Link relationship (noopener noreferrer is automatically added when _blank is used)","features#Features":"Add toggleable Table of Contents (enable via params.toc.enabled: true) Support custom head partials Add projects content support button \u0026 icon shortcodes","icon-shortcodes#Icon Shortcodes":"Display SVG icons from the ~/assets/icons/ directory:\n{\\{\u003c icon name=\"heart\" \u003e}\\} {\\{\u003c icon name=\"github\" size=\"lg\" \u003e}\\} {\\{\u003c icon name=\"sun\" class=\"text-primary\" \u003e}\\} Parameters:\nname: Icon name (required) - Check assets/icons/ for available icons or place custom icons in this directory, or place the custom icon in this directory size: xs, sm, md, lg, xl, 2xl (default: md) class: Custom CSS class, which can be used to change colors"},"title":"Narrow v1.2.1"},"/docs/":{"data":{"":"This document provides a detailed guide to using the Hugo Narrow theme, helping you build your website from scratch.\nIt covers website creation, theme installation, content file organization, basic Hugo configuration, Hugo Narrow-specific configuration, shortcodes, and advanced customization. After reading this document, you will gain a deeper understanding of Hugo Narrow.\nNow explore the following parts to learn how to create you new site:\nQuick Start\rIf you are a professional user of hugo, explore the following parts to learn the features of Hugo Narrow:\nFeatures"},"title":"Documentation"},"/docs/advanced/":{"data":{"":"Explore the following parts to learn how to custom Hugo Narrow:\nCustom Hugo Narrow"},"title":"Advanced"},"/docs/advanced/custom-theme/":{"data":{"":"","compile#Compile":"Install dependencies in the root directory of the site: pnpm add -D tailwindcss @tailwindcss/cli. Create custom style files in ~/assets/css/custom.css directory. Compiled the style files: npx tailwindcss -i ./assets/css/main.css -o ./assets/css/compiled.css.","custom-head#Custom Head":"Modify in ~/layouts/_partials/layout/head/custom-head.html.","custom-javascript#Custom JavaScript":"Create javascript files with any filename in ~/assets/js/custom/ directory, then modify there.","custom-style#Custom style":"","directly#Directly":"Create CSS files with any filename in ~/assets/css/custom/ directory, then modify there.","uses-themes-by-git-submodule#Uses themes by git submodule":"When you add the theme using git submodule, copy the theme files you want to modify to the same path in the site’s root directory and define your modifications there.\nWith this method, you cannot commit changes to GitHub.\nIf you want to save your modifications to a GitHub repository, you can fork the theme and then replace the git submodule address with your repository address.","uses-themes-by-hugo-mod#Uses themes by hugo mod":"When you add the theme by hugo mod, it will not generate any files in ~/themes directory, you need find the files in the github repsitory, copy the files you want to modify to the same path in the site’s root directory and define your modifications there."},"title":"Custom Hugo Narrow"},"/docs/configurations/":{"data":{"":"Configuration falls under the scope of Hugo’s basic settings, and is not significantly different from the configuration method of most Hugo sites. It mainly covers three sections: basic configuration, menu configuration, and multilingual configuration.\nExplore the following sections to learn how to configure site:\nBasic\rMenus\rMultilingual"},"title":"Configurations"},"/docs/configurations/basic-config/":{"data":{"":"Hugo supports hugo.toml、hugo.yaml、hugo.json format and follow the order, supporting split configuration file by envirament, root configuration key, and language.\nNote\nSee Hugo Documentation for more details.\nHugo Narrow uses split configuration with YAML.\nexampleSite config _default hugo.yaml languages.yaml menus.yaml params.yaml content The site configuration is not much different from that of a regular Hugo site; the special part is:\npermalinks.projects sets the permalinks for projects. outputFormats.WebAppManifest automatically generates the WebAppManifest configuration for the theme. highlight.lineNumbersInTable needs to be set to false. highlight.style setting does not take effect. To change the Hugo Narrow codeblock style, you need to modify the CSS files. The minimum required version of Hugo is 0.146. baseURL: https://hugo-narrow.vercel.app/ languageCode: en-US defaultContentLanguage: en defaultContentLanguageInSubdir: false title: Hugo Narrow theme: \"hugo-narrow\" hasCJKLanguage: true enableEmoji: true permalinks: posts: /posts/:slug/ projects: /projects/:slug/ pages: /:slug/ pagination: pagerSize: 6 path: \"page\" taxonomies: category: categories tag: tags markup: tableOfContents: startLevel: 2 endLevel: 4 ordered: false goldmark: renderer: unsafe: true extensions: extras: delete: enable: true insert: enable: true mark: enable: true subscript: enable: false superscript: enable: false strikethrough: false highlight: codeFences: true guessSyntax: false lineNos: false lineNumbersInTable: false # Set to false noClasses: false style: github # No need to change tabWidth: 2 outputs: home: [\"HTML\", \"RSS\", \"JSON\", \"WebAppManifest\"] # Custom output outputFormats: WebAppManifest: mediaType: \"application/manifest+json\" baseName: \"site\" isPlainText: true module: hugoVersion: extended: true min: 0.146.0"},"title":"Basic"},"/docs/configurations/menus/":{"data":{"":"Hugo Narrow supports three menus：\nMain menu at header footer menu social menu The icon is the icon before the title. It uses the SVG format and should be placed in the hugo-narrow/assets/icons/ directory. The filename is used as the parameter value for reference.\nTip\nYou can find more great icons at Iconify Design .\nThe name value uses the i18n translation file key by default. You can change it to any string and add the translation value in the translation file.\nexampleSite/config/_default/menus.yamlmain: - name: nav.posts pageRef: /posts weight: 20 params: icon: posts - name: nav.projects pageRef: /projects weight: 25 params: icon: projects - name: nav.categories pageRef: /categories weight: 30 params: icon: categories - name: nav.tags pageRef: /tags weight: 40 params: icon: tags - name: nav.archives pageRef: /archives weight: 50 params: icon: archive # footer menu footer: - name: About pageRef: /about weight: 10 params: icon: about - name: Contact url: https://google.com weight: 20 params: icon: contact - name: RSS Feed url: /index.xml weight: 30 params: icon: rss # social link social: - name: GitHub url: https://github.com/username weight: 10 params: icon: github - name: Twitter url: https://twitter.com/username weight: 20 params: icon: twitter - name: LinkedIn url: https://linkedin.com/in/username weight: 30 params: icon: linkedin - name: Email url: mailto:your.email@example.com weight: 40 params: icon: email"},"title":"Menus"},"/docs/configurations/multilingual/":{"data":{"":"Hugo Narrow supports the multilingual sites, with a toggle button available in the navigation bar for language switching.\nCurrently, Hugo Narrow supports the following languages:\nar: Arabic de: German en: English es: Spanish fr: French it: Italian ja: Japanese ko: Korean pt: Portuguese ru: Russian vi: Vietnamese zh-cn: Simplified Chinese zh-tw: Traditional Chinese Note\nThe translation is generated by AI. Feel free to open an issue or submit a PR if you wish to add to or refine the translation.\nTo set up a multilingual site, you first need to configure the default language in the site configuration.\nhugo.yamldefaultContentLanguage: zh-cn Create the translation configuration file\nlanguages.yamlen: languageCode: en-US languageName: \"English\" weight: 1 zh-cn: languageCode: zh-CN languageName: \"简体中文\" weight: 2 ja: languageCode: ja-JP languageName: \"日本語\" weight: 3 fr: languageCode: fr-FR languageName: \"Français\" weight: 4 Hugo supports two primary approaches to organizing multilingual files: file name translation and directory translation. Each approach has its own advantages and applicable scenarios.","translation-by-content-directory#Translation by Content Directory":"Translation by content directory need to specify the content directory of translation:\nlanguages.yamllanguages: en: contentDir: content/english languageName: English weight: 10 zh-CN: contentDir: content/zh-CN languageName: 简体中文 weight: 20 content/ ├── en/ │ ├── posts/ │ │ └── my-first-post.md │ ├── about/ │ │ └── _index.md │ └── _index.md ├── zh-cn/ │ ├── posts/ │ │ └── my-first-post.md │ ├── about/ │ │ └── _index.md │ └── _index.md ├── ja/ │ ├── posts/ │ │ └── my-first-post.md │ ├── about/ │ │ └── _index.md │ └── _index.md └── fr/ ├── posts/ │ └── my-first-post.md ├── about/ │ └── _index.md └── _index.md Note\nBy this way, the content directory has more level, see Hugo Documatation for more deatils.","translation-by-file-name#Translation by File Name":"If you have an article named content/posts/my-first-post.md, you can specify a language suffix before the file extension to create content/posts/my-first-post.zh-cn.md as its Simplified Chinese translation.\ncontent/ ├── posts/ │ ├── my-first-post.md │ ├── my-first-post.zh-cn.md │ ├── my-first-post.ja.md │ └── my-first-post.fr.md ├── about/ │ ├── _index.md │ ├── _index.zh-cn.md │ ├── _index.ja.md │ └── _index.fr.md └── _index.md"},"title":"Multilingual"},"/docs/content-management/":{"data":{"":"Explore the following sections to learn how to manage content:\nOrganize Files\rLocal Resources\rArchetypes\rFrontmatter\rMarkdown"},"title":"Content Management"},"/docs/content-management/archetypes/":{"data":{"":"Archetypes is template for new content, located at ~/archetypes. A content file consists of frontmatter and markup. Frontmatter can be TOML, YAML, JSON.\n~/archetypes/default.md is the default archetype. Hugo Narrow include two archetypes:\narchetypes/default.md: default archetype, used for posts and others. archetypes/projects.md: project archetype, used for project files.","create-a-new-post#Create a new post":"Use the following command to create a new post named my-first-post with the default archetype:\nhugo new content posts/my-first-post.md","create-a-new-project#Create a new project":"Use the following command to create a new project named my-first-project with the project archetype:\nhugo new content projects/my-first-project.md # use `--kind` parameter hugo new content --kind projects projects/my-first-project.md","custom-archetypes#Custom archetypes":"If you need create your own archetype, create a file at the root folder of the site: ~/archetypes/default.md\nHugo follows the lookup order for archetypes:\narchetypes/posts.md themes/hugo-narrow/archetypes/posts.md archetypes/default.md themes/hugo-narrow/archetypes/default.md If none of these exists, Hugo uses a built-in default archetype.\nNote\nSee Hugo Documentation for more details."},"title":"Archetypes"},"/docs/content-management/frontmatter/":{"data":{"":"Frontmatter is configruation section at the beginning of markdown files, it uses two --- wrap (different data uses different symbol wrap, YAML is recommended) to define posts’ basic information, or cover some parameters in hugo.yaml. Every archetypes has common and unique frontmatters.\nIf you don’t know what is archetypes, see Archetypes.","basic#Basic":"--- # required title: \"Post Title\" date: 2025-06-13 # Optinal description: \"Post description\" draft: false categories: [\"categories 1\", \"categories 2\"] tags: [\"tags 1\", \"tags 2\"] slug: \"custom-url\" --- If you don’t matter SEO, you can use the theme archetypes to auto generate slug, it generates a random 7-digit string.\nslug: {{ substr .File.UniqueID 0 7 }} Note\nSee Hugo Documentation for more frontmatter.","default-archetypes#Default Archetypes":"Default archetypes is used to generate posts and other content for which no content template is defined.","fixed#Fixed":"cover value support a external link or local resources, local resources follow the lookup order: Page Resources\u003e Global Resources \u003e Static Resources。\nIf you don’t know how to import local resources, see Local Resources.","other-frontmatter#Other frontmatter":"Default(Posts) archetypes also support other frontmatters, these configurations involve some features of the theme, usually configured in hugo.yaml, but you can also modify the overrides in the frontmatter.\n# math formula katex: enabled: true delimiters: - left: $$ right: $$ display: true - left: $ right: $ display: false # charts mermaid: enabled: true # related posts showRelated: true # posts license post: license: show: true author: \"Hugo Narrow\" name: \"CC BY-NC-SA 4.0\" description: \"This work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License. Please attribute the source, use non-commercially, and maintain the same license.\" url: \"https://creativecommons.org/licenses/by-nc-sa/4.0/\" displayName: \"CC BY-NC-SA 4.0\" # Glightbox lightbox: enabled: true loop: true width: 80vw height: 80vh touchNavigation: true draggable: true zoomable: true preload: true descPosition: bottom # gallery justified_gallery: enabled: true rowHeight: 300 gutter: 30 lastRow: center transitionDuration: 0.3s resizeDebounce: 100 rowHeightTolerance: 0.25 maxRowsCount: 999999 calculateItemsHeight: false","post-cover#Post Cover":"Follow this to set a post cover:\ncover: \"\" Hugo Narrow has a fallback for cover:\ncover value cover has no value if ~/data/placeholder_images.yaml set enabled: true, use random cover list. if ~/data/placeholder_images.yaml set enabled: false, automatically generate a placeholder.","projects-archetype#Projects Archetype":"The projects archetype is used to generate project files. The basic frontmatter parameter are the same as the default archetype. There are also unique frontmatter. The following are the unique parameters of the projects archetype:\ncover: \"\" # same as default archetype featured: false github: \"\" demo: \"\" website: \"\" tech_stack: - Technology 1 - Technology 2 status: \"completed\" # Options: completed, in_progress, planning","random-cover#Random Cover":"cover value is unset and ~/data/placeholder_images.yaml set enabled: true, you can place a random cover list at ~/data/placeholder_images.yaml:\nenabled: true # Cover URLs (external link or local link) images: # Picsum Photos #- \"https://picsum.photos/800/600?random=1\" #- \"https://picsum.photos/800/600?random=2\" #- \"https://picsum.photos/800/600?random=3\" #- \"https://picsum.photos/800/600?random=4\" #- \"https://picsum.photos/800/600?random=5\" #- \"https://picsum.photos/800/600?random=6\u0026blur=1\" #- \"https://picsum.photos/800/600?random=7\u0026grayscale\" # local images - \"/images/placeholder/1.jpg\" - \"/images/placeholder/2.jpg\" - \"/images/placeholder/3.jpg\" - \"/images/placeholder/4.jpg\" - \"/images/placeholder/5.jpg\" - \"/images/placeholder/6.jpg\" - \"/images/placeholder/7.jpg\" - \"/images/placeholder/8.jpg\" cover value is unset and ~/data/placeholder_images.yaml set enabled: false, Hugo Narrow will generate some placeholder whick adapt for color schemes automatically."},"title":"Frontmatter"},"/docs/content-management/local-resources/":{"data":{"":"Hugo Narrow support import local resources such as images with three methods:\nPage Bundles (markdown folder) Global Resources (assets folder) Static Resources (static folder) Tip\nHugo Narrow follow the order to index the local resources：Page Bundles \u003e Global Resources \u003e Static Resources","different#Different":"Location Use Page Bundles ~/content/posts/post-1/featured.jpg featured.jpg Global Resources ~/assets/images/featured.jpg images/featured.jpg Static Resources ~/static/images/featured.jpg /images/featured.jpg Note\nimages is not necessary, you can change it.","global-resources#Global Resources":"Global resources are placed in the assets folder at the root directory of the site: ~/assets/. Resources placed in this folder will be processed by Hugo during the build.\nmy-site assets images hero.jpg content themes hugo-narrow Use in Markdown:\n![](images/hero.jpg) Note\nSee Hugo documentation for more details.","page-bundles#Page Bundles":"Page Bundles refer to resource files located in the same directory as the Markdown file. This is the most recommended method for managing image resources.\ncontent posts post-1.md post-1.zh-cn.md post-2 index.md index.zh-cn.md featured.jpg gallery image-1.jpg image-2.jpg Use in Markdown:\n![](featured.jpg) ![](gallery/image-1.jpg) ![](gallery/image-2.jpg) Note\nSee Hugo documentation for more details.","static-resources#Static Resources":"Static resources are placed in the assets folder at the root directory of the site: ~/static/. Resources placed in this folder will NOT be processed by Hugo during the build.\nmy-site static images hero.jpg content themes hugo-narrow Use in Markdown:\n![](/images/hero.jpg) Note\nSee Hugo documentation for more details."},"title":"Local Resources"},"/docs/content-management/markdown/":{"data":{"":"Hugo Narrow use Goldmark to render markdown files. By default, the superscript and the subscript are disabled, you can change the parameters according to the Hugo Documentation to enable them.","chart#Chart":"Hugo Narrow supports charts by Mermaid, you can change the parameters at frontmatter or hugo.yaml, the frontmatter has higher priority, the supported parameters are following as these:\nparams: mermaid: enabled: true # enable Mermaid","github-alert#GitHub Alert":"Hugo Narrow support GitHub Alert, Obsidian foldable alert also supported. Before Hugo native support it, some themes use the shortcodes named Admonition to provide the same style.\nNote\nObsidian’s foldable alert will not affected at other editors, it will render as the default alert.\nUse as the following:\n\u003e [!NOTE] \u003e This is a note alert. \u003e [!TIP] \u003e This is a tip alert. \u003e [!IMPORTANT] \u003e This is a important alert. \u003e [!WARNING] \u003e This is a warning alert. \u003e [!CAUTION] \u003e This is a caution alert. \u003e [!NOTE] custom title \u003e This is a custom tiltle note alert. \u003e [!NOTE]- Foldable alert with custom title \u003e This is a foldable alert, default is folded. \u003e [!NOTE]+ Foldable alert with custom title \u003e This is a foldable alert, default is unfolded.","math-formula#Math Formula":"Hugo Narrow supports math formula by katex, you can change the parameters at frontmatter or hugo.yaml, the frontmatter has higher priority, the supported parameters are following as these:\nparams: katex: enabled: true # enable KaTeX delimiters: # delimiters - left: \"$$\" right: \"$$\" display: true - left: \"$\" right: \"$\" display: false - left: \"\\\\(\" right: \"\\\\)\" display: false - left: \"\\\\[\" right: \"\\\\]\" display: true"},"title":"Markdown"},"/docs/content-management/organize-files/":{"data":{"":"","contents-structure#Contents Structure":"By default, Hugo indexes all Markdown files in the content directory, and the contents structure determines the final site output structure.","page-bundles#Page Bundles":"The files that are generally confusing to distinguish are index.md and _index.md.\nBefore making the distinction, you need to understand a concept — Page Bundles. A Page Bundle is a directory that contains content files (such as md files or html files) and related resources (such as image resources). Page Bundles are divided into two types: Branch Bundles and Leaf Bundles.\nA Leaf Bundle is a directory that contains an index.md file and zero or more resources. As the terminal node of a content branch, a Leaf Bundle cannot contain subpages.\nA Branch Bundle refers to a directory that contains a _index.md file and zero or more resources. Just like a tree branch, it can have subpages and can contain Leaf Bundles. The top-level directory is always a Branch Bundle (regardless of whether an _index.md file exists in it) and also includes the homepage.\nTherefore, _index.md is the index file of a Branch Bundle, while index.md is the content file of a Leaf Bundle. For example, content/posts/_index.md represents the index file of the the posts branch bundle, and the content written in it will be output to specific positions on the posts page according to the theme template. On the other hand, content/posts/post-1/index.md represents the content file of a Leaf Bundle under the posts directory.\nThus, if you place each article in a separate folder, you can use index.md as the file name, e.g., content/posts/first-post/index.md. If you do not intend to use a folder, you need to specify a Markdown file name directly, e.g., content/posts/first-post.md. You can also use both methods together, so the following approach is valid:\ncontent _index.md posts _index.md post-1.md post-1.zh-cn.md post-2 index.md Note\nSee Hugo Documentation for more details."},"title":"Organize Files"},"/docs/features/":{"data":{"":"This section describes the feature configurations of Hugo Narrow. All these configurations are located under the params node in the hugo.yaml configuration file, covering the settings of site homepage, navigation bar, Dock bar, table of contents, comments, image gallery and other functions. It serves as the core functional configuration module of Hugo Narrow.\nExplore the following sections to learn how to configure Hugo Narrow:\nSEO\rHome\rAuthor\rHeader\rDock\rColor Schemes\rPosts\rComments\rAnalytics\rFormula and Charts\rCodeblock\rGallery\rMiscellaneous"},"title":"Features"},"/docs/features/analytics/":{"data":{"":"Hugo Narrow supports kinds of analytics engines：\nBaidu Clarity Google Umami params.yamlanalytics: enabled: false baidu: enabled: false id: \"your-baidu-analytics-id\" clarity: enabled: false id: \"your-clarity-analytics-id\" google: enabled: false id: \"your-google-analytics-id\" umami: enabled: false id: \"your-umami-website-id\" src: \"https://umami.com/myscript.js\" domains: \"example.domain.com\""},"title":"Analytics"},"/docs/features/author/":{"data":{"":"Hugo Narrow author information render at hoempage, in the sample configuration, the avatar file is placed in the ~/static/ directory. icon value uses the file name of ~/assets/icons/ directory.\nparams.yamlauthor: name: \"Hugo Narrow\" title: \"A Clean and Minimal Hugo Theme\" description: \"Focused on content and user experience.\" avatar: \"/images/avatar.svg\" social: - name: \"GitHub\" url: \"https://github.com/username\" icon: \"github\" - name: \"Twitter\" url: \"https://twitter.com/username\" icon: \"twitter\" - name: \"Email\" url: \"mailto:hello@example.com\" icon: \"email\""},"title":"Author"},"/docs/features/codeblock/":{"data":{"":"Hugo Narrow add kinds of functions for codeblock:\nclick to copy code language display collapse codeblock params.yamlcodeblock: collapse: enabled: true defaultState: expanded # expanded, collapsed autoCollapseLines: 30 autoCollapseHeight: 400 collapsedHeight: 120","highlight#Highlight":"Hugo Narrow uses chroma for syntax highlighting, with github and github-dark as the styles for light and dark modes respectively.\nTo better integrate with the theme, the style files are created and adapted using the command hugo gen chromastyles --style=github \u003e ./assets/css/github.css. Modifying the highlighting styles also requires generating them via the command line, making the process of replacing them somewhat complex:\nGenerate the styles using the hugo cli. Replace the corresponding theme variable colors in ~/assets/css/chroma.css. # view all chroma styles hugo gen chromastyles --help # generate style files hugo gen chromastyles --style=github \u003e ./github.css hugo gen chromastyles --style=github-dark \u003e ./github-dark.css"},"title":"Codeblock"},"/docs/features/color-schemes/":{"data":{"":"Hugo Narrow build in many color schemes, you can change scheme by the button at header, custom schemes also supported.\nparams.yamlcolorScheme: \"default\" themes: default: name: \"Default\" order: 1 claude: name: \"Claude\" order: 2 bumblebee: name: \"Bumblebee\" order: 3 emerald: name: \"Emerald\" order: 4 nord: name: \"Nord\" order: 5 sunset: name: \"Sunset\" order: 6 abyss: name: \"Abyss\" order: 7 dracula: name: \"Dracula\" order: 8 amethyst: name: \"Amethyst\" order: 9 slate: name: \"Slate\" order: 10 twitter: name: \"Twitter\" order: 11","custom-schemes#Custom Schemes":"If you want to add your scheme, create a css file at ~/assets/css/custom/ directory, then add the new scheme in params.themes in the above, here is the virable sample:\n[data-theme=\"dracula\"] { --color-primary: oklch(0.70 0.15 346.812); --color-primary-foreground: oklch(0.98 0.007 106.545); --color-secondary: oklch(0.68 0.12 301.883); --color-secondary-foreground: oklch(0.98 0.007 106.545); --color-accent: oklch(0.75 0.10 66.558); --color-accent-foreground: oklch(0.20 0.024 66.558); --color-background: oklch(0.95 0.01 277.508); --color-foreground: oklch(0.30 0.022 277.508); --color-muted: oklch(0.90 0.015 277.508); --color-muted-foreground: oklch(0.50 0.02 277.508); --color-border: oklch(0.82 0.02 277.508); --color-card: oklch(0.95 0.01 277.508); --color-card-foreground: oklch(0.30 0.022 277.508); --color-popover: oklch(0.97 0.005 277.508); --color-popover-foreground: oklch(0.30 0.022 277.508); --color-note: oklch(0.65 0.15 240); --color-tip: oklch(0.70 0.14 160); --color-important: oklch(0.70 0.15 346.812); --color-warning: oklch(0.75 0.16 85); --color-caution: oklch(0.65 0.18 15); } [data-theme=\"dracula\"].dark { --color-primary: oklch(0.755 0.183 346.812); --color-primary-foreground: oklch(0.151 0.036 346.812); --color-secondary: oklch(0.742 0.148 301.883); --color-secondary-foreground: oklch(0.148 0.029 301.883); --color-accent: oklch(0.834 0.124 66.558); --color-accent-foreground: oklch(0.167 0.024 66.558); --color-background: oklch(0.288 0.022 277.508); --color-foreground: oklch(0.977 0.007 106.545); --color-muted: oklch(0.394 0.032 275.524); --color-muted-foreground: oklch(0.879 0.006 275.524); --color-border: oklch(0.45 0.035 277.508); --color-card: oklch(0.32 0.025 277.508); --color-card-foreground: oklch(0.977 0.007 106.545); --color-popover: oklch(0.394 0.032 275.524); --color-popover-foreground: oklch(0.977 0.007 106.545); --color-note: oklch(0.70 0.14 240); --color-tip: oklch(0.75 0.13 160); --color-important: oklch(0.755 0.183 346.812); --color-warning: oklch(0.80 0.15 85); --color-caution: oklch(0.70 0.17 15); } Note\nYou can also add new scheme at ~/assets/css/theme.css or ~/assets/css/custom.css.\nDependencies are required: pnpm add -D tailwindcss @tailwindcss/cli\nRun the compile command: npx tailwindcss -i ./assets/css/main.css -o ./assets/css/compiled.css"},"title":"Color Schemes"},"/docs/features/comments/":{"data":{"":"Hugo Narrow supports kinds of comments:\nartalk disqus giscus twikoo utterances waline Tip\nThe parameter of the toggle of comments can be coverd by posts frontmatter.\nfirst-post.mdcomments: true params.yamlcomments: enabled: false system: \"giscus\" giscus: repo: \"tom2almighty/hugo-narrow-giscus\" repoId: \"\" category: \"General\" categoryId: \"\" mapping: \"pathname\" strict: \"0\" reactionsEnabled: \"1\" emitMetadata: \"0\" inputPosition: \"bottom\" theme: \"preferred_color_scheme\" lang: \"en\" disqus: shortname: \"\" utterances: repo: \"\" issueTerm: \"pathname\" label: \"comment\" theme: \"preferred-color-scheme\" waline: serverURL: \"\" lang: \"zh-CN\" artalk: server: \"\" site: \"\" locale: \"zh-CN\" # String|Object|\"auto\" darkMode: \"auto\" gravatar: mirror: \"https://cravatar.cn/avatar/\" twikoo: envId: \"\" region: \"ap-shanghai\" path: \"\" lang: \"zh-CN\""},"title":"Comments"},"/docs/features/dock/":{"data":{"":"Hugo Narrow provide common function by dock, include back to top, back to previous page, jump to comments, search, table of contents.\nDock has three display modes:\nscroll： show on scroll up always： always visible float： show on floating params.yamldock: \"scroll\" # scroll | always | float","table-of-contents#Table of Contents":"Tip\nThe parameters of table of contents could cover by posts frontmatter.\nIn the initial design, the table of contents was displayed in the middle of the page and controlled via the Dock, which aligns with the theme’s design philosophy and ensures consistent performance across different devices. However, multiple issues requesting a sidebar table of contents were submitted, so support for the sidebar table of contents and the parameter for configuring its position were added in version 1.2.\nNote\nThe sidebar table of contents is only enabled on devices with a screen width greater than 1280px.\nparams.yamltoc: enabled: true position: \"left\" maxWidth: \"280px\" maxHeight: \"80vh\""},"title":"Dock"},"/docs/features/formulas-charts/":{"data":{"":"","charts#Charts":"Hugo Narrwo supports charts by Mermaid .\nTip\nThe toggle of mermaid can be covered by frontmatter of posts.\nmermaid: true params.yamlmermaid: enabled: true","formulas#Formulas":"Hugo Narrwo supports formulas by Katex .\nTip\nThe parameters of Katex can be covered by the frontmatter of posts.\nparams.yamlkatex: enabled: true delimiters: - left: \"$$\" right: \"$$\" display: true - left: \"$\" right: \"$\" display: false - left: \"\\\\(\" right: \"\\\\)\" display: false - left: \"\\\\[\" right: \"\\\\]\" display: true"},"title":"Formulas and Charts"},"/docs/features/gallery/":{"data":{"":"Hugo Narrow supports lightbox, use GLightbox . Also justified gallery, use lickr-justified-gallery , writing by markdown.Masonry gallery use Macy.js , writting by shortcode.\nTip\nThe parameters of gallery can be coverd by posts frontmatter.\nparams.yaml# GLightbox lightbox: enabled: false loop: true width: 80vw height: 80vh touchNavigation: true draggable: true zoomable: true preload: true descPosition: bottom # Justified Gallery justified_gallery: enabled: false rowHeight: 300 gutter: 30 lastRow: center transitionDuration: 0.3s resizeDebounce: 100 rowHeightTolerance: 0.25 maxRowsCount: 999999 calculateItemsHeight: false","justified-gallery#Justified Gallery":"Directly import image resources using markdown syntax, with one resource link per line. Image groups without empty lines between them are considered as one gallery. The example below shows two galleries, the first containing two image resources, and the second containing three image resources.\n![](images/image01.jpg) ![](images/image02.jpg) ![](images/image03.jpg) ![](images/image04.jpg) ![](images/image05.jpg)","masonry-gallery#Masonry Gallery":"Masonry gallery use shortcode, see Extended Shortcodes for more details."},"title":"Gallery"},"/docs/features/header/":{"data":{"":"Hugo Narrow supports set sticky header, logo, theme switch, dark mode switch, language switch.\nlogo placed at ~/static directory, leave empty to use site title first letter. Language switch mode is supported which is click to switch(cycle) or click to show panel(dropdown). params.yamlheader: sticky: true logo: image: \"/images/logo.svg\" # Logo path relative to static folder, leave empty to use site title first letter link: \"/\" # Click to home page # UI Components Control (header controls) showThemeSwitch: true # Set to false to hide theme style switcher (palette icon) showDarkModeSwitch: true # Set to false to hide dark mode switcher (sun/moon icon) showLanguageSwitch: true # Set to false to hide language switcher languageSwitchMode: \"dropdown\" # Language switch mode: \"dropdown\" (show panel) or \"cycle\" (direct cycle)"},"title":"Header"},"/docs/features/home/":{"data":{"":"Hugo Narro suports set the count of recent posts of home, you can also add custom sections to home.\nCreate custom section partials at layouts/_partials/home/ folder. Then add you custom section partials file name to contentOrder, site will be rendered as the list order. If you want to delete section at home, just delete the partial at the list. params.yamlhome: recentPostsCount: 5 contentOrder: - author-section - custom_1.html - featured-projects.html - recent-posts - page-content"},"title":"Home"},"/docs/features/miscellaneous/":{"data":{"":"This include some miscellaneous configurations.","reading-progress#Reading Progress":"params.yamlreadingProgress: enabled: true height: 3 showOnHomepage: false smoothScroll: true hideOnComplete: false"},"title":"Miscellaneous"},"/docs/features/posts/":{"data":{"":"Hugo Narrow supports configure the license of posts and the related posts.\nTip\nThe parameters of license could cover by posts frontmatter.\nparams.yamlpost: showRelated: true relatedPostsCount: 3 license: show: true author: \"Hugo Narrow\" name: \"CC BY-NC-SA 4.0\" description: \"This work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License. Please attribute the source, use non-commercially, and maintain the same license.\" url: \"https://creativecommons.org/licenses/by-nc-sa/4.0/\" displayName: \"CC BY-NC-SA 4.0\""},"title":"Posts"},"/docs/features/seo/":{"data":{"":"SEO configuration used for Search Engine Optimization, favicon use SVG format.\nparams.yaml# Basic site info with SEO description: \"A modern, clean, and minimal Hugo theme built with Tailwind CSS 4.0. Support custom themes, dark mode, and responsive design.\" keywords: [\"Hugo\", \"Blog\", \"Theme\", \"Technology\", \"Programming\"] defaultAuthor: \"Hugo Narrow\" language: \"en-US\" shortName: \"Hugo Narrow\" # PWA images: - \"/images/og-default.avif\" # Favicon favicon: svg: \"/favicon.svg\" # SVG format favicon (recommended)"},"title":"SEO"},"/docs/overview/":{"data":{"":"👋 Hello, there! Welcome to the hugo narrow documentation.\nHugo Narrow is a clean and modern Hugo theme for personal blogs, built with Tailwind CSS 4.0, featuring multiple color schemes and user customization support.","contributing#Contributing":"All forms of contributions are welcome, including but not limited to:\nBug reports Feature suggestions Code contributions Documentation improvements Note\nPlease visit the GitHub repository to contribute: Hugo Narrow","features#Features":"Multiple Color Schemes Custom Colors Dark Mode Table of Contents Search Comments Analytics Enhanced Markdown Enhanced Code Blocks Multilingual Katex Mermaid Lightbox by GLightbox Justified Gallery with markdown Masonry Gallery with shortcode"},"title":"Overview"},"/docs/quickstart/":{"data":{"":"Hugo Narrow supports three import methods:\nHugo Mod Git Submodule Download zip files The Hugo Mod method is fast and convenient. If you need advanced customization of the theme, the Git Submodule method is more suitable after fork. The method of downloading the theme compression package is also relatively convenient, but it is difficult to update the theme subsequently, so this method is not recommended.\nLearn how to import Hugo Narrow through the following chapters:\nHugo Mod\rGit Submodule"},"title":"Quickstart"},"/docs/quickstart/git-submodule/":{"data":{"":"","add-hugo-narrow-as-a-git-submodule#Add hugo narrow as a git submodule":"cd my-site git init git submodule add https://github.com/tom2almighty/hugo-narrow.git themes/hugo-narrow","copy-example-site-files#Copy example site files":"Copy all files of ~/themes/hugo-narrow/exampleSite/ to the root folder of the site.\nMake sure the configuration at ~/config/_default/hugo.yaml is right： theme: hugo-narrow.\nNote\nIf you need to modify the theme, copy the theme files you want to modify to the same path in the root directory of your site and define your modifications there.\nWith this method, you cannot commit modifications to GitHub. If you want to save your modifications to a GitHub repository, you can fork the theme and then replace the submodule added via git submodule with your repository address.","init-a-new-site#Init a new site":"hugo new site my-site --format=yaml","localhost-preview#Localhost preview":"hugo server --buildDrafts --disableFastRender Visit http://localhost:1313 see your new site.","prerequisites#Prerequisites":"You should install the following softwares before start:\nHugo Extended , Version 0.146 or later Git","steps#Steps":"","update-theme#Update theme":"To update ALL submodule, use the command:\ngit submodule update --remote --recursive To update theme submodule, use the command:\ngit submodule update --remote --recursive themes/hugo-narrow Note\nSee Git Submodule for more details."},"title":"Git Submodule"},"/docs/quickstart/hugo-mod/":{"data":{"":"","copy-examplesite-files#Copy exampleSite files":"Copy the full files of hugo-narrow/exampleSite/ to the root folder. This method will NOT Create any files at ~/themes/, visit theme repository see the files.\nModify hugo-narrow/config/_default/hugo.yaml, import theme according to hugo mod：\nmodule: hugoVersion: extended: true min: 0.146.0 imports: - path: github.com/tom2almighty/hugo-narrow","import-theme-with-hugo-mod#Import theme with hugo mod":"# Init hugo mod cd my-site hugo mod init github.com/username/my-site # add Hugo Narrow hugo mod get github.com/tom2almighty/hugo-narrow","init-a-new-site#Init a new site":"hugo new site my-site --format=yaml","localhost-preview#Localhost preview":"hugo server --buildDrafts --disableFastRender Visit http://localhost:1313 see your new site.","prerequisites#Prerequisites":"You should install the following softwares before start:\nHugo Extended , Version 0.146 or later Git Go","steps#Steps":"","update-theme#Update theme":"To update ALL mods use the command：\nhugo mod get -u To update the theme mod use the command:\nhugo mod get -u github.com/tom2almighty/hugo-narrow Note\nClick Hugo Mod to visit hugo mod update documentation."},"title":"Hugo Mod"},"/docs/shortcodes/":{"data":{"":"Shortcodes are Hugo’s way of extending content and styles. Hugo has some built-in shortcodes, and Hugo Narrow provides several additional ones.\nExplore the following sections to learn how to use shortcodes:\nBuild in Shortcodes\rExtended Shortcodes"},"title":"Shortcodes"},"/docs/shortcodes/build-in-shortcodes/":{"data":{"":"Hugo has built in some shortcodes:\nDetails Figure Gist Highlight Instagram Param QR Ref Relref Vimeo X YouTube These shortcodes usually unstable and could be changed at anytime, Hugo Narrow lacks special optimizations for these shortcodes.\nSee Hugo Documentation learn how to use these build in shortcodes."},"title":"Build in Shortcodes"},"/docs/shortcodes/extended-shortcodes/":{"data":{"":"Delete the \\ between {{ and }}.","bilibili#Bilibili":"{\\{\u003c bilibili VIDEO_ID PART_NUMBER \u003e}\\} Support AV number or BV number, PART_NUMBER is optinal, specifies which part to display when provided.","button#Button":"{\\{\u003c button text=\"Learn More\" url=\"/about\" \u003e}\\} {\\{\u003c button text=\"GitHub\" url=\"https://github.com\" icon=\"github\" target=\"_self\" \u003e}\\} {\\{\u003c button text=\"Download\" url=\"/download\" variant=\"outline\" size=\"lg\" \u003e}\\} Parameters:\ntext: Button text (required, or use inner content) url: Link address (required) variant: primary, secondary, outline (default: primary) size: sm, md, lg (default: md) icon: Theme icon name target: _blank, _self (default: _blank) rel: Link relationship (noopener noreferrer is automatically added when _blank is used)","custom-shortcodes#Custom shortcodes":"Add your shortcode templates in the ~/layout/_shortcodes directory. If using Tailwind CSS, you’ll need to compile styles locally to apply them to the theme.","icon#Icon":"Display SVG icons from the ~/assets/icons/ directory:\n{\\{\u003c icon name=\"heart\" \u003e}\\} {\\{\u003c icon name=\"github\" size=\"lg\" \u003e}\\} {\\{\u003c icon name=\"sun\" class=\"text-primary\" \u003e}\\} Parameters:\nname: Icon name (required) - Check assets/icons/ for available icons or place custom icons in this directory, or place the custom icon in this directory size: xs, sm, md, lg, xl, 2xl (default: md) class: Custom CSS class, which can be used to change colors","link-cards#Link cards":"Link cards support three methods to import.","masonry-gallery#Masonry Gallery":"{\\{\u003c masonry columns=4 gutter=15 \u003e}\\} ![Image 1](image1.jpg) ![Image 2](image2.jpg) {\\{\u003c /masonry \u003e}\\}","tencent-video#Tencent Video":"{\\{\u003c tencent VIDEO_ID \u003e}\\}","use-group-or-category-parameter#Use group or category parameter":"List data at data/links.yaml, then use group or category parameter:\n{\\{\u003c link group=\"social\" \u003e}\\} {\\{\u003c link category=\"social\" \u003e}\\} Note\nicon paramater is not required, if you don’t define the value, the partials will find the favicon file(.svg/.ico), if still find no avaliable icons, it will fallback to link.svg of assets folder.","use-id-or-ref-paremeter#Use id or ref paremeter":"List data at data/links.yaml, then use id or ref parameter:\n{\\{\u003c link id=\"github\" \u003e}\\} {\\{\u003c link ref=\"github\" \u003e}\\} data/links.yamlsocial: - id: github title: GitHub description: The world's largest code hosting platform. url: https://github.com icon: https://github.com/fluidicon.png - id: linkedin title: LinkedIn description: Career Social Network. url: https://linkedin.com tool: - id: vercel title: Vercel description: Deploy and Development Platform. url: https://vercel.com icon: https://vercel.com/favicon.ico - id: netlify title: Netlify description: Deploy and Development Platform. url: https://netlify.com icon: https://netlify.com/favicon.ico - id: github-pages title: GitHub Pages description: Static Pages Hosting. url: https://pages.github.com icon: https://github.com/fluidicon.png","use-parameters-directly#Use parameters directly":"{\\{\u003c link title=\"Google\" description=\"The world largest search engine.\" url=\"https://google.com\" icon=\"https://google.com/favicon.ico\" \u003e}\\}"},"title":"Extended Shortcodes"}}